[
    "What is the school's policy on cell phone usage during class?",
    "Are students allowed to wear hats or head coverings in school?",
    "What are the consequences for tardiness?",
    "How does the school handle bullying incidents?",
    "What is the dress code policy?",
    "Are students allowed to leave campus during lunch breaks?",
    "What is the policy on homework assignments?",
    "How does the school handle academic dishonesty?",
    "What are the guidelines for student participation in extracurricular activities?",
    "What is the school's attendance policy?",
    "How does the school handle requests for religious accommodations?",
    "What is the policy on student transfers between classes?",
    "Are there restrictions on what students can bring to school?",
    "What is the policy on student use of social media?",
    "How does the school handle requests for special educational needs?",
    "What is the policy on student fundraising activities?",
    "Are there guidelines for student behavior on school buses?",
    "What is the school's policy on physical education requirements?",
    "How does the school handle student medical emergencies?",
    "What is the policy on student access to school computers and internet?",
    "Are there restrictions on student publications or newspapers?",
    "What is the policy on student parking on school grounds?",
    "How does the school handle requests for gender identity accommodations?",
    "What is the policy on student participation in school governance?",
    "Are there guidelines for student-teacher communication outside of school hours?",
    "What is the school's policy on field trips and excursions?",
    "How does the school handle requests for course exemptions or substitutions?",
    "What is the policy on student use of lockers?",
    "Are there restrictions on student clubs or organizations?",
    "What is the school's policy on makeup work for absences?",
    "How does the school handle requests for accelerated or advanced placement?",
    "What is the policy on student use of personal electronic devices in class?",
    "Are there guidelines for student behavior at school-sponsored events?",
    "What is the school's policy on student privacy and data protection?",
    "How does the school handle requests for language support for non-native speakers?",
    "What is the policy on student use of school facilities after hours?",
    "Are there restrictions on student expression or free speech?",
    "What is the school's policy on student counseling services?",
    "How does the school handle requests for alternative assessments?",
    "What is the policy on student participation in school sports teams?",
    "Are there guidelines for student internships or work-study programs?",
    "What is the school's policy on student health and vaccination requirements?",
    "How does the school handle requests for schedule changes?",
    "What is the policy on student use of library resources?",
    "Are there restrictions on student relationships or dating?",
    "What is the school's policy on student representation in disciplinary hearings?",
    "How does the school handle requests for accommodations for students with disabilities?",
    "What is the policy on student participation in standardized testing?",
    "Are there guidelines for student behavior during assemblies or presentations?",
    "What is the school's policy on student records and transcripts?"
  ]